extra-voat12/src/main/docs/phase1/1_response_erfolg.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.extra-standard.de/namespace/response/1" xmlns:ns1="http://www.extra-standard.de/namespace/components/1" xmlns:xe="http://www.w3.org/2001/04/xmlenc#" xmlns:xd="http://www.w3.org/2000/09/xmldsig#" xmlns:ns2="http://www.extra-standard.de/namespace/logging/1">
   <soapenv:Header/>
   <soapenv:Body>
      <xres:Transport xmlns:ns2="http://www.extra-standard.de/namespace/request/1" xmlns:xlog="http://www.extra-standard.de/namespace/logging/1" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xsrv="http://www.extra-standard.de/namespace/service/1" xmlns:xplg="http://www.extra-standard.de/namespace/plugins/1" xmlns:xres="http://www.extra-standard.de/namespace/response/1" xmlns:xcpt="http://www.extra-standard.de/namespace/components/1" xmlns:xmsg="http://www.extra-standard.de/namespace/message/1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
         <xres:TransportHeader>
            <xcpt:TestIndicator>http://wwwxextra-standardxde/test/NONE</xcpt:TestIndicator>
            <xcpt:Sender>
               <xcpt:ReceiverID>es-1</xcpt:ReceiverID>
               <xcpt:Name>eXTra-Server</xcpt:Name>
            </xcpt:Sender>
            <xcpt:Receiver>
               <xcpt:SenderID>ec-1</xcpt:SenderID>
               <xcpt:Name>eXTra-Client</xcpt:Name>
            </xcpt:Receiver>
            <xcpt:RequestDetails>
               <xcpt:RequestID>PROC_VOAT12_FETCH_REQ_1</xcpt:RequestID>
               <xcpt:TimeStamp>2001-12-17T09:30:47.0Z</xcpt:TimeStamp>
               <xcpt:Application>
                  <xcpt:Product>eXTra Client OpenSource</xcpt:Product>
                  <xcpt:Manufacturer>OpenSource</xcpt:Manufacturer>
               </xcpt:Application>
               <xcpt:Procedure>http://www.extra-standard.de/procedures/Voat12</xcpt:Procedure>
               <xcpt:DataType>http://www.extra-standard.de/datatype/DataRequest</xcpt:DataType>
               <xcpt:Scenario>http://www.extra-standard.de/scenario/request-with-response</xcpt:Scenario>
            </xcpt:RequestDetails>
            <xcpt:ResponseDetails>
               <xcpt:ResponseID class="0">4_RESP</xcpt:ResponseID>
               <xcpt:TimeStamp>2001-12-17T09:30:47.0Z</xcpt:TimeStamp>
               <xcpt:Report highestWeight="http://www.extra-standard.de/weight/INFO">
                  <xcpt:Flag weight="http://www.extra-standard.de/weight/INFO">
                     <xcpt:Code>E98</xcpt:Code>
                     <xcpt:Text>Anfrage erfolgreich</xcpt:Text>
                  </xcpt:Flag>
               </xcpt:Report>
            </xcpt:ResponseDetails>
         </xres:TransportHeader>
         <xres:TransportBody>
            <xres:Package>
               <xres:PackageHeader>
                  <xcpt:RequestDetails>
                     <xcpt:RequestID>PROC_VOAT12_FETCH_REQ_1</xcpt:RequestID>
                  </xcpt:RequestDetails>
                  <xcpt:ResponseDetails>
                     <xcpt:ResponseID>PROC_VOAT12_FETCH_RESP_1</xcpt:ResponseID>
                     <xcpt:Report>
                        <xcpt:Flag>
                           <xcpt:Code>C00</xcpt:Code>
                           <xcpt:Text>O.K.</xcpt:Text>
                        </xcpt:Flag>
                     </xcpt:Report>
                  </xcpt:ResponseDetails>
               </xres:PackageHeader>
               <xres:PackagePlugIns>
		    	  <xplg:DataSource> 
		        	  <xplg:DataContainer type="http://www.extra-standard.de/container/FILE" created="2014-06-17T10:20:11.0Z" encoding="I1" name="VOAT12_1.tst"/> 
			      </xplg:DataSource> 
               </xres:PackagePlugIns>
               <xres:PackageBody>
                  <xcpt:Data>
                     <xcpt:Base64CharSequence>UkZWTlRWa2dVbVZ6Y0c5dWMyVWdabTl5SUZGMVpYSjVJRUZ5WjNWdFpXNTBPbEpGVTFCUFRsTkZYMGxFWDFCb1lYTmxYekZUUlU1RVgwWkZWRWhmTVE9PQ==</xcpt:Base64CharSequence>
                  </xcpt:Data>
               </xres:PackageBody>
            </xres:Package>
            <xres:Package>
               <xres:PackageHeader>
                  <xcpt:RequestDetails>
                     <xcpt:RequestID>PROC_VOAT12_FETCH_REQ_1</xcpt:RequestID>
                  </xcpt:RequestDetails>
                  <xcpt:ResponseDetails>
                     <xcpt:ResponseID>PROC_VOAT12_FETCH_RESP_2</xcpt:ResponseID>
                     <xcpt:Report>
                        <xcpt:Flag>
                           <xcpt:Code>C00</xcpt:Code>
                           <xcpt:Text>O.K.</xcpt:Text>
                        </xcpt:Flag>
                     </xcpt:Report>
                  </xcpt:ResponseDetails>
               </xres:PackageHeader>
               <xres:PackagePlugIns>
		    	  <xplg:DataSource> 
		        	  <xplg:DataContainer type="http://www.extra-standard.de/container/FILE" created="2012-12-21T10:20:11.0Z" encoding="I1" name="VOAT12_1.tst"/> 
			      </xplg:DataSource> 
               </xres:PackagePlugIns>
               <xres:PackageBody>
                  <xcpt:Data>
                     <xcpt:Base64CharSequence>UkZWTlRWa2dVbVZ6Y0c5dWMyVWdabTl5SUZGMVpYSjVJRUZ5WjNWdFpXNTBPbEpGVTFCUFRsTkZYMGxFWDFCb1lYTmxYekZUUlU1RVgwWkZWRWhmTXc9PQ==</xcpt:Base64CharSequence>
                  </xcpt:Data>
               </xres:PackageBody>
            </xres:Package>
         </xres:TransportBody>
      </xres:Transport>
   </soapenv:Body>
</soapenv:Envelope>