branches/extra-modules-1.0.0-bugfix/java/procedures/extra-sterbedaten-ausland/src/main/docs/phase3/3_request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><xreq:Transport xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:xcpt="http://www.extra-standard.de/namespace/components/1" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xlog="http://www.extra-standard.de/namespace/logging/1" xmlns:xmsg="http://www.extra-standard.de/namespace/message/1" xmlns:xplg="http://www.extra-standard.de/namespace/plugins/1" xmlns:xreq="http://www.extra-standard.de/namespace/request/1" xmlns:xres="http://www.extra-standard.de/namespace/response/1" xmlns:xsrv="http://www.extra-standard.de/namespace/service/1" profile="http://code.google.com/p/extra-standard/profile/1" version="1.3">
    <xreq:TransportHeader>
        <xcpt:TestIndicator>http://www.extra-standard.de/test/NONE</xcpt:TestIndicator>
        <xcpt:Sender>
            <xcpt:SenderID>ec-1</xcpt:SenderID>
            <xcpt:Name>eXTra-Client</xcpt:Name>
        </xcpt:Sender>
        <xcpt:Receiver>
            <xcpt:ReceiverID>es-1</xcpt:ReceiverID>
            <xcpt:Name>eXTra-Server</xcpt:Name>
        </xcpt:Receiver>
        <xcpt:RequestDetails>
            <xcpt:RequestID>10002</xcpt:RequestID>
            <xcpt:TimeStamp>2012-12-18T15:20:30</xcpt:TimeStamp>
            <xcpt:Application>
                <xcpt:Product>eXTra Klient OpenSource</xcpt:Product>
                <xcpt:Manufacturer>OpenSource</xcpt:Manufacturer>
                <xcpt:RegistrationID/>
            </xcpt:Application>
            <xcpt:Procedure>http://www.extra-standard.de/procedures/SterbemeldungAusland</xcpt:Procedure>
            <xcpt:DataType>http://www.extra-standard.de/datatypes/ConfirmationOfReceipt</xcpt:DataType>
            <xcpt:Scenario>http://www.extra-standard.de/scenario/request-with-acknowledgement</xcpt:Scenario>
        </xcpt:RequestDetails>
    </xreq:TransportHeader>
    <xreq:TransportPlugIns/>
    <xreq:TransportBody>
        <xcpt:Data>
            <xcpt:ElementSequence>
                <xmsg:listOfConfirmationOfReceipt>
                    <xmsg:ConfirmationOfReceipt>
                        <xmsg:PropertySet name="http://www.extra-standard.de/property/ResponseID">
                            <xmsg:Value>10002</xmsg:Value>
                        </xmsg:PropertySet>
                    </xmsg:ConfirmationOfReceipt>
                </xmsg:listOfConfirmationOfReceipt>
            </xcpt:ElementSequence>
        </xcpt:Data>
    </xreq:TransportBody>
</xreq:Transport></SOAP-ENV:Body></SOAP-ENV:Envelope>